{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "5b3db559",
   "metadata": {},
   "source": [
    "# 1.1-load-gfe-db / Load Database\n",
    "\n",
    "Development notebook for executing Cypher transactions through the Neo4j HTTP API.\n",
    "\n",
    "Activities:\n",
    "- Generate S3 pre-signed URL for each CSV\n",
    "- Update the load script with the pre-signed URL\n",
    "- Execute the load script via Run Command\n",
    "- Validate that the load script has been executed or is running"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "638c79e6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style>.container { width:100% !important; }</style>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "from IPython.core.display import display, HTML\n",
    "display(HTML(\"<style>.container { width:100% !important; }</style>\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "e62686d6",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv, find_dotenv\n",
    "load_dotenv(find_dotenv());"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "88205970",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/ammon/Documents/00-Projects/nmdp-bioinformatics/02 Repositories/gfe-db/.venv/lib/python3.8/site-packages/requests/__init__.py:89: RequestsDependencyWarning: urllib3 (1.26.6) or chardet (3.0.4) doesn't match a supported version!\n",
      "  warnings.warn(\"urllib3 ({}) or chardet ({}) doesn't match a supported \"\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import sys\n",
    "sys.path.append(\"../\") if \"../\" not in sys.path else None\n",
    "import logging\n",
    "import re\n",
    "import time\n",
    "import base64\n",
    "import json\n",
    "import requests\n",
    "import boto3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "6ea1c7a8",
   "metadata": {},
   "outputs": [],
   "source": [
    "logger = logging.getLogger()\n",
    "logger.setLevel(logging.INFO)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "5c6f391a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# !source ../scripts/set_env.sh"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0de4488",
   "metadata": {},
   "source": [
    "## Generate Pre-signed URLs for CSV files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "2c0deebc",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Environment variables\n",
    "root = os.environ[\"ROOT\"]\n",
    "scripts_dir = os.environ[\"BIN_DIR\"]\n",
    "src_dir = os.environ[\"SRC_DIR\"]\n",
    "data_dir = os.environ[\"DATA_DIR\"]\n",
    "logs_dir = os.environ[\"LOGS_DIR\"]\n",
    "cypher_dir = os.environ[\"CYPHER_PATH\"]\n",
    "load_script = os.environ[\"SCRIPT\"]\n",
    "\n",
    "s3_bucket = os.environ[\"GFE_BUCKET\"]\n",
    "release = os.environ[\"RELEASES\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "1aa0345f",
   "metadata": {},
   "outputs": [],
   "source": [
    "s3_urls = [\n",
    "    's3://gfe-db-4498/data/RELEASE/csv/all_groups.RELEASE.csv',\n",
    "    's3://gfe-db-4498/data/RELEASE/csv/all_cds.RELEASE.csv',\n",
    "    's3://gfe-db-4498/data/RELEASE/csv/all_features.RELEASE.csv',\n",
    "    's3://gfe-db-4498/data/RELEASE/csv/gfe_sequences.RELEASE.csv',\n",
    "    's3://gfe-db-4498/data/RELEASE/csv/all_alignments.RELEASE.csv'\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "eb82f684",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Probably not needed\n",
    "path = \"/\".join([logs_dir, \"s3CopyLog.txt\"])\n",
    "path = \".\" + path\n",
    "\n",
    "def parseS3CopyLog(path):\n",
    "    \n",
    "    logger.info(f\"Parsing file: {path}\")\n",
    "    \n",
    "    # Identify S3 urls in text\n",
    "    pattern = r's3:\\/\\/([^/]+)\\/([\\w\\W]+)\\.(.*)'\n",
    "    s3_urls = []\n",
    "    \n",
    "    try:\n",
    "        with open(path, \"r\") as file:\n",
    "            for line in file.readlines():\n",
    "                if \"upload\" in line:\n",
    "                    s3_url = re.search(pattern, line).group(0)\n",
    "                    s3_urls.append(s3_url)\n",
    "                    logger.info(f\"Found: {s3_url}\")\n",
    "    except Exception as err:\n",
    "        logger.error(\"Could not parse file\")\n",
    "        raise err\n",
    "        \n",
    "    return s3_urls"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a7ca15f4",
   "metadata": {},
   "outputs": [],
   "source": [
    "s3 = boto3.client('s3')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c2750cff",
   "metadata": {},
   "outputs": [],
   "source": [
    "s3_path = f\"s3://{s3_bucket}/logs/{release}/s3CopyLog.txt\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "11973c0b",
   "metadata": {},
   "outputs": [
    {
     "ename": "NoSuchKey",
     "evalue": "An error occurred (NoSuchKey) when calling the GetObject operation: The specified key does not exist.",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNoSuchKey\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-13-00569706b0fd>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m s3CopyLog = s3.get_object(\n\u001b[0m\u001b[1;32m      2\u001b[0m     \u001b[0mBucket\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0ms3_bucket\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m     Key=f\"logs/{release}/s3CopyLog.txt\")\n",
      "\u001b[0;32m~/Documents/00-Projects/nmdp-bioinformatics/02 Repositories/gfe-db/.venv/lib/python3.8/site-packages/botocore/client.py\u001b[0m in \u001b[0;36m_api_call\u001b[0;34m(self, *args, **kwargs)\u001b[0m\n\u001b[1;32m    384\u001b[0m                     \"%s() only accepts keyword arguments.\" % py_operation_name)\n\u001b[1;32m    385\u001b[0m             \u001b[0;31m# The \"self\" in this scope is referring to the BaseClient.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 386\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_make_api_call\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0moperation_name\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    387\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    388\u001b[0m         \u001b[0m_api_call\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__name__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mstr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mpy_operation_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/Documents/00-Projects/nmdp-bioinformatics/02 Repositories/gfe-db/.venv/lib/python3.8/site-packages/botocore/client.py\u001b[0m in \u001b[0;36m_make_api_call\u001b[0;34m(self, operation_name, api_params)\u001b[0m\n\u001b[1;32m    703\u001b[0m             \u001b[0merror_code\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mparsed_response\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Error\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Code\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    704\u001b[0m             \u001b[0merror_class\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mexceptions\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfrom_code\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror_code\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 705\u001b[0;31m             \u001b[0;32mraise\u001b[0m \u001b[0merror_class\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mparsed_response\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0moperation_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    706\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    707\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mparsed_response\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNoSuchKey\u001b[0m: An error occurred (NoSuchKey) when calling the GetObject operation: The specified key does not exist."
     ]
    }
   ],
   "source": [
    "s3CopyLog = s3.get_object(\n",
    "    Bucket=s3_bucket,\n",
    "    Key=f\"logs/{release}/s3CopyLog.txt\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "f74f6421",
   "metadata": {},
   "outputs": [],
   "source": [
    "# s3_urls = parseS3CopyLog(path)\n",
    "s3_urls = list(map(lambda x: x.replace(\"RELEASE\", release), s3_urls))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "f659b131",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['s3://gfe-db-4498/data/3440/csv/all_groups.3440.csv',\n",
       " 's3://gfe-db-4498/data/3440/csv/all_cds.3440.csv',\n",
       " 's3://gfe-db-4498/data/3440/csv/all_features.3440.csv',\n",
       " 's3://gfe-db-4498/data/3440/csv/gfe_sequences.3440.csv',\n",
       " 's3://gfe-db-4498/data/3440/csv/all_alignments.3440.csv']"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "s3_urls"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "id": "9ae144e3",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the service client.\n",
    "s3 = boto3.client('s3')\n",
    "\n",
    "def generate_presigned_urls(s3_urls, expire=3600):\n",
    "    \"\"\"Accepts a list of S3 URLs or paths and returns\n",
    "    a dictionary of pre-signed URLs for each\"\"\"\n",
    "    \n",
    "    logger.info(f\"Generating pre-signed URLs...\")\n",
    "    \n",
    "    s3_urls = [s3_urls] if not isinstance(s3_urls, list) else s3_urls\n",
    "    \n",
    "    presigned_urls = {}\n",
    "    \n",
    "    for s3_url in s3_urls:\n",
    "        \n",
    "        i = 2 if \"s3://\" in s3_url else 0\n",
    "        \n",
    "        bucket = s3_url.split(\"/\")[i]\n",
    "        key = \"/\".join(s3_url.split(\"/\")[i + 1:])\n",
    "        \n",
    "        # Generate the URL to get 'key-name' from 'bucket-name'\n",
    "        url = s3.generate_presigned_url(\n",
    "            ClientMethod='get_object',\n",
    "            Params={\n",
    "                'Bucket': bucket,\n",
    "                'Key': key\n",
    "            },\n",
    "            ExpiresIn=expire\n",
    "        )\n",
    "        \n",
    "        presigned_urls[s3_url] = url\n",
    "        \n",
    "    return presigned_urls"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 140,
   "id": "6f954116",
   "metadata": {},
   "outputs": [],
   "source": [
    "presigned_urls = generate_presigned_urls(s3_urls)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b35637f",
   "metadata": {},
   "source": [
    "## Update the load script with the pre-signed URL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 141,
   "id": "ba048b5b",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_path = \"/\".join([root, f'{cypher_dir}/{load_script}'])\n",
    "cypher_path = \".\" + cypher_path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 142,
   "id": "b7423b51",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'../neo4j/cypher/load.cyp'"
      ]
     },
     "execution_count": 142,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 143,
   "id": "614b0915",
   "metadata": {},
   "outputs": [],
   "source": [
    "def update_cypher(cypher_path):\n",
    "    \"\"\"Replaces instances of \"file:///{csv_prefix}.RELEASE.csv\" with\n",
    "    an S3 pre-sign URL\"\"\"\n",
    "\n",
    "    with open(cypher_path, \"r\") as file:\n",
    "        cypher_script = file.read()\n",
    "\n",
    "    for s3_url in s3_urls:\n",
    "\n",
    "        csv_prefix = s3_url.split(\"/\")[-1].split(\".\")[0]\n",
    "        cypher_script = cypher_script.replace(f'file:///{csv_prefix}.RELEASE.csv', presigned_urls[s3_url])\n",
    "        \n",
    "    return cypher_script"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 144,
   "id": "c04303a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_script = update_cypher(cypher_path)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "febda61c",
   "metadata": {},
   "source": [
    "## HTTP Request to load GFE DB"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1756e9af",
   "metadata": {},
   "source": [
    "### Test Neo4j Server"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 145,
   "id": "75ad326e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"bolt_routing\" : \"neo4j://44.192.54.30:7687\",\n",
      "  \"transaction\" : \"http://44.192.54.30:7474/db/{databaseName}/tx\",\n",
      "  \"bolt_direct\" : \"bolt://44.192.54.30:7687\",\n",
      "  \"neo4j_version\" : \"4.3.2\",\n",
      "  \"neo4j_edition\" : \"community\"\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "url = f\"http://{host}:{port}\"\n",
    "\n",
    "# Send requests\n",
    "response = requests.get(\n",
    "    url, \n",
    "    headers={\n",
    "        \"Accept\": \"application/json\"\n",
    "    })\n",
    "\n",
    "print(response.text)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "id": "52a8bcdd",
   "metadata": {},
   "outputs": [],
   "source": [
    "protocol = 'http'\n",
    "host = \"44.192.54.30\"\n",
    "username = \"neo4j\"\n",
    "password = \"gfedb\"\n",
    "port = \"7474\"\n",
    "endpoint = \"db/neo4j/tx/commit\"\n",
    "url = f'{protocol}://{host}:{port}/{endpoint}'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "id": "f4d73e9a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'http://44.192.54.30:7474/db/neo4j/tx/commit'"
      ]
     },
     "execution_count": 147,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "url"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "id": "78227057",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = list(filter(lambda x: x != \"\\n\", cypher_script.split(\";\")))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 149,
   "id": "4d338d36",
   "metadata": {},
   "outputs": [],
   "source": [
    "#cypher = list(filter(lambda x: \"//\" in x, cypher))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "43d60721",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = list(map(lambda x: \"\".join([x, \";\"]), cypher))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "id": "e0325628",
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_cypher(cypher, debug=False):\n",
    "    \n",
    "    payload = {\n",
    "        \"statements\": [\n",
    "            {\n",
    "                \"statement\": cypher\n",
    "            }\n",
    "        ]\n",
    "    }\n",
    "    \n",
    "    logger.debug(payload)\n",
    "    \n",
    "    # Headers\n",
    "    headers = { \n",
    "        \"Accept\": \"application/json;charset=UTF-8\",\n",
    "        \"Content-Type\": \"application/json\",\n",
    "        \"Authorization\": f\"Basic {base64.b64encode(':'.join([username, password]).encode()).decode()}\"\n",
    "    }\n",
    "\n",
    "    # Send requests\n",
    "    response = requests.post(\n",
    "        url, \n",
    "        data=json.dumps(payload), \n",
    "        headers=headers)\n",
    "    \n",
    "    try:\n",
    "        response_dict = json.loads(response.content)\n",
    "    except Exception as err:\n",
    "        logger.error(f\"Failed to load response from Neo4j server: {response.status_code}\")\n",
    "        #raise err\n",
    "        return\n",
    "    \n",
    "    # if debug:\n",
    "    #     print(f\"statement: {statement}\")\n",
    "    #     print(f\"response: {response}\\n\\n\")\n",
    "    \n",
    "    if len(response_dict['errors']) > 0:\n",
    "        logger.error(response_dict)\n",
    "    else:\n",
    "        logger.info(response_dict)\n",
    "    \n",
    "    return response_dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 152,
   "id": "1fe39c1d",
   "metadata": {},
   "outputs": [],
   "source": [
    "#cypher = \"MATCH (m:Movie) RETURN m LIMIT 3\"\n",
    "#response = run_cypher(cypher, debug=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "id": "1f97e64c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"// RETURN '(:GFE)' AS `Creating GFE nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000\\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\\nMERGE (gfe:GFE { gfe_name: row.gfe_name })\\nON CREATE SET gfe.locus = row.locus;\",\n",
       " \"\\n// RETURN '(:Sequence)' AS `Creating Sequence nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000\\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\\nMERGE (seq:Sequence { gfe_name: row.gfe_name })\\nON CREATE SET seq.seq_id = row.seq_id,\\n    seq.locus = row.locus,\\n    seq.sequence = row.sequence,\\n    seq.length = row.length;\",\n",
       " \"\\n// RETURN '(:Feature)' AS `Creating Feature nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000\\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_features.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=1J0HI5JeWa6bc3g%2Foqx1vV6PXq4%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\\nMERGE (f:Feature { \\n    locus: row.locus,\\n    rank: row.rank,\\n    term: row.term,\\n    accession: row.accession\\n    });\",\n",
       " \"\\n// RETURN '(:GenomicAlignment)' AS `Creating GenomicAlignment nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\\nFOREACH(_ IN CASE \\n    WHEN align_row.label = 'GEN_ALIGN' THEN [1] \\n    ELSE [] END |\\n        MERGE (gen:GenomicAlignment { bp_sequence: align_row.bp_sequence })\\n        ON CREATE SET gen.label = 'GEN',\\n            gen.seq_id = align_row.seq_id,\\n            gen.rank = align_row.rank\\n);\",\n",
       " \"\\n// RETURN '(:NucleotideAlignment)' AS `Creating NucleotideAlignment nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\\nFOREACH(_ IN CASE \\n    WHEN align_row.label = 'NUC_ALIGN' THEN [1] \\n    ELSE [] END |\\n        MERGE (nuc:NucleotideAlignment { bp_sequence: align_row.bp_sequence })\\n        ON CREATE SET nuc.label = 'NUC', \\n            nuc.seq_id = align_row.seq_id,\\n            nuc.rank = align_row.rank\\n);\",\n",
       " \"\\n// RETURN '(:ProteinAlignment)' AS `Creating ProteinAlignment nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\\nFOREACH(_ IN CASE \\n    WHEN align_row.label = 'PROT_ALIGN' THEN [1] \\n    ELSE [] END |\\n        MERGE (prot:ProteinAlignment { aa_sequence: align_row.aa_sequence })\\n        ON CREATE SET prot.label = 'PROT', \\n            prot.seq_id = align_row.seq_id,\\n            prot.rank = align_row.rank\\n);\",\n",
       " \"\\n// RETURN '(:CDS)' AS `Creating CDS nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_cds.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=8kzH%2FRzYLQ%2BZc4VNwaegvDRTbpE%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as cds_row\\nMERGE (cds:CDS { gfe_name: cds_row.gfe_name })\\nON CREATE SET cds.bp_seq_id = cds_row.bp_seq_id,\\n    cds.bp_sequence = cds_row.bp_sequence,\\n    cds.bp_length = size(cds_row.bp_sequence),\\n    cds.aa_seq_id = cds_row.aa_seq_id,\\n    cds.aa_sequence = cds_row.aa_sequence,\\n    cds.aa_length = size(cds_row.aa_sequence);\",\n",
       " \"\\n// RETURN '(:IMGT_HLA)' AS `Creating IMGT_HLA nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000\\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\\nMERGE (imgt:IMGT_HLA { name: row.hla_name })\\nON CREATE SET imgt.releases = [replace(row.imgt_release, '.', '')]\\nON MATCH SET imgt.releases = imgt.releases + [replace(row.imgt_release, '.', '')];\",\n",
       " \"\\nRETURN '(:G)' AS `Creating G nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\\nFOREACH(_ IN CASE \\n    WHEN groups_row.ard_name = 'G' THEN [1] \\n    ELSE [] END | \\n        MERGE (_g:G { ard_id: groups_row.ard_id })\\n        ON CREATE SET _g.label = 'G'\\n);\",\n",
       " \"\\n// RETURN '(:lg)' AS `Creating lg nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\\nFOREACH(_ IN CASE \\n    WHEN groups_row.ard_name = 'lg' THEN [1] \\n    ELSE [] END |\\n        MERGE (_lg:lg { ard_id: groups_row.ard_id })\\n        ON CREATE SET _lg.label = 'lg'\\n);\",\n",
       " \"\\n// RETURN '(:lgx)' AS `Creating lgx nodes...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\\nFOREACH(_ IN CASE \\n    WHEN groups_row.ard_name = 'lgx' THEN [1] \\n    ELSE [] END |\\n        MERGE (_lgx:lgx { ard_id: groups_row.ard_id })\\n        ON CREATE SET _lgx.label = 'lgx'\\n);\",\n",
       " \"\\n// RETURN '(:IMGT_HLA)-[:HAS_GFE]->(:GFE)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000\\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\\nMATCH (gfe:GFE { gfe_name: row.gfe_name })\\nMATCH (imgt:IMGT_HLA { name: row.hla_name })\\nMERGE (imgt)-[rel:HAS_GFE]->(gfe)\\nON CREATE SET rel.releases = [replace(row.imgt_release, '.', '')]\\nON MATCH SET rel.releases = rel.releases + [replace(row.imgt_release, '.', '')];\",\n",
       " \"\\n// RETURN '(:GFE)-[:HAS_SEQUENCE]->(:Sequence)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000\\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\\nMATCH (gfe:GFE { gfe_name: row.gfe_name })\\nMATCH (seq:Sequence { sequence: row.sequence })\\nMERGE (gfe)-[:HAS_SEQUENCE]->(seq);\",\n",
       " \"\\n// apoc.periodic.iterate()\\n// RETURN '(:GFE)-[:HAS_FEATURE]->(:Feature)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000\\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_features.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=1J0HI5JeWa6bc3g%2Foqx1vV6PXq4%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\\nMATCH (gfe:GFE { gfe_name: row.gfe_name })\\nMATCH (f:Feature { \\n    locus: row.locus,\\n    rank: row.rank,\\n    term: row.term,\\n    accession: row.accession\\n    })\\nMERGE (gfe)-[:HAS_FEATURE]->(f);\",\n",
       " \"\\n// RETURN '(:GFE)-[:HAS_ALIGNMENT]->(:GenomicAlignment)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\\nMATCH (gfe:GFE { gfe_name: align_row.gfe_name })\\nMATCH (gen:GenomicAlignment { bp_sequence: align_row.bp_sequence })\\nMERGE (gfe)-[:HAS_ALIGNMENT]->(gen);\",\n",
       " \"\\n// RETURN '(:GFE)-[:HAS_ALIGNMENT]->(:NucleotideAlignment)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\\nMATCH (gfe:GFE { gfe_name: align_row.gfe_name })\\nMATCH (nuc:NucleotideAlignment { bp_sequence: align_row.bp_sequence })\\nMERGE (gfe)-[:HAS_ALIGNMENT]->(nuc);\",\n",
       " \"\\n// RETURN '(:GFE)-[:HAS_ALIGNMENT]->(:ProteinAlignment)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\\nMATCH (gfe:GFE { gfe_name: align_row.gfe_name })\\nMATCH (prot:ProteinAlignment { aa_sequence: align_row.aa_sequence })\\nMERGE (gfe)-[:HAS_ALIGNMENT]->(prot);\",\n",
       " \"\\n// apoc.periodic.iterate()\\n// RETURN '(:IMGT_HLA)-[:G]->(:G)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\\nMATCH (hla:IMGT_HLA { name: groups_row.hla_name })\\nMATCH (_g:G { ard_id: groups_row.ard_id }) \\nMERGE (hla)-[:G]->(_g);\",\n",
       " \"\\n// apoc.periodic.iterate()\\n// RETURN '(:IMGT_HLA)-[:lg]->(:lg)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\\nMATCH (hla:IMGT_HLA { name: groups_row.hla_name })\\nMATCH (_lg:lg { ard_id: groups_row.ard_id }) \\nMERGE (hla)-[:lg]->(_lg);\",\n",
       " \"\\n// apoc.periodic.iterate()\\n// RETURN '(:IMGT_HLA)-[:lgx]->(:lgx)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\\nMATCH (hla:IMGT_HLA { name: groups_row.hla_name })\\nMATCH (_lgx:lgx { ard_id: groups_row.ard_id })\\nMERGE (hla)-[:lgx]->(_lgx);\",\n",
       " \"\\n// RETURN '(:Sequence)-[:HAS_CDS]->(:CDS)' AS `Creating relationships...`;\",\n",
       " \"\\nUSING PERIODIC COMMIT 50000 \\nLOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_cds.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=8kzH%2FRzYLQ%2BZc4VNwaegvDRTbpE%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as cds_row\\nMATCH (gfe:GFE)-[:HAS_SEQUENCE]->(seq:Sequence)\\nMATCH (cds:CDS { bp_sequence: cds_row.bp_sequence })\\nWHERE cds_row.gfe_name = gfe.gfe_name\\nMERGE (seq)-[:HAS_CDS]->(cds);\"]"
      ]
     },
     "execution_count": 153,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "id": "ceb22e1f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Executing statement: // RETURN '(:GFE)' AS `Creating GFE nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 1, column 48 (offset: 47))\\n\"// RETURN \\'(:GFE)\\' AS `Creating GFE nodes...`;\"\\n                                               ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.2277510166168213\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 1, column 48 (offset: 47))\\n\"// RETURN \\'(:GFE)\\' AS `Creating GFE nodes...`;\"\\n                                               ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000\n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\n",
      "MERGE (gfe:GFE { gfe_name: row.gfe_name })\n",
      "ON CREATE SET gfe.locus = row.locus;\n",
      "Time elapsed: 0.883246898651123\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:Sequence)' AS `Creating Sequence nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 58 (offset: 58))\\n\"// RETURN \\'(:Sequence)\\' AS `Creating Sequence nodes...`;\"\\n                                                         ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.22400474548339844\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 58 (offset: 58))\\n\"// RETURN \\'(:Sequence)\\' AS `Creating Sequence nodes...`;\"\\n                                                         ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000\n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\n",
      "MERGE (seq:Sequence { gfe_name: row.gfe_name })\n",
      "ON CREATE SET seq.seq_id = row.seq_id,\n",
      "    seq.locus = row.locus,\n",
      "    seq.sequence = row.sequence,\n",
      "    seq.length = row.length;\n",
      "Time elapsed: 0.3809018135070801\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:Feature)' AS `Creating Feature nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 56 (offset: 56))\\n\"// RETURN \\'(:Feature)\\' AS `Creating Feature nodes...`;\"\\n                                                       ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.21252202987670898\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 56 (offset: 56))\\n\"// RETURN \\'(:Feature)\\' AS `Creating Feature nodes...`;\"\\n                                                       ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000\n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_features.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=1J0HI5JeWa6bc3g%2Foqx1vV6PXq4%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\n",
      "MERGE (f:Feature { \n",
      "    locus: row.locus,\n",
      "    rank: row.rank,\n",
      "    term: row.term,\n",
      "    accession: row.accession\n",
      "    });\n",
      "Time elapsed: 0.9114189147949219\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:GenomicAlignment)' AS `Creating GenomicAlignment nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 74 (offset: 74))\\n\"// RETURN \\'(:GenomicAlignment)\\' AS `Creating GenomicAlignment nodes...`;\"\\n                                                                         ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.2136087417602539\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 74 (offset: 74))\\n\"// RETURN \\'(:GenomicAlignment)\\' AS `Creating GenomicAlignment nodes...`;\"\\n                                                                         ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\n",
      "FOREACH(_ IN CASE \n",
      "    WHEN align_row.label = 'GEN_ALIGN' THEN [1] \n",
      "    ELSE [] END |\n",
      "        MERGE (gen:GenomicAlignment { bp_sequence: align_row.bp_sequence })\n",
      "        ON CREATE SET gen.label = 'GEN',\n",
      "            gen.seq_id = align_row.seq_id,\n",
      "            gen.rank = align_row.rank\n",
      ");\n",
      "Time elapsed: 0.49288105964660645\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:NucleotideAlignment)' AS `Creating NucleotideAlignment nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 80 (offset: 80))\\n\"// RETURN \\'(:NucleotideAlignment)\\' AS `Creating NucleotideAlignment nodes...`;\"\\n                                                                               ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.20926833152770996\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 80 (offset: 80))\\n\"// RETURN \\'(:NucleotideAlignment)\\' AS `Creating NucleotideAlignment nodes...`;\"\\n                                                                               ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\n",
      "FOREACH(_ IN CASE \n",
      "    WHEN align_row.label = 'NUC_ALIGN' THEN [1] \n",
      "    ELSE [] END |\n",
      "        MERGE (nuc:NucleotideAlignment { bp_sequence: align_row.bp_sequence })\n",
      "        ON CREATE SET nuc.label = 'NUC', \n",
      "            nuc.seq_id = align_row.seq_id,\n",
      "            nuc.rank = align_row.rank\n",
      ");\n",
      "Time elapsed: 0.39541196823120117\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:ProteinAlignment)' AS `Creating ProteinAlignment nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 74 (offset: 74))\\n\"// RETURN \\'(:ProteinAlignment)\\' AS `Creating ProteinAlignment nodes...`;\"\\n                                                                         ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.2139568328857422\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 74 (offset: 74))\\n\"// RETURN \\'(:ProteinAlignment)\\' AS `Creating ProteinAlignment nodes...`;\"\\n                                                                         ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\n",
      "FOREACH(_ IN CASE \n",
      "    WHEN align_row.label = 'PROT_ALIGN' THEN [1] \n",
      "    ELSE [] END |\n",
      "        MERGE (prot:ProteinAlignment { aa_sequence: align_row.aa_sequence })\n",
      "        ON CREATE SET prot.label = 'PROT', \n",
      "            prot.seq_id = align_row.seq_id,\n",
      "            prot.rank = align_row.rank\n",
      ");\n",
      "Time elapsed: 0.404771089553833\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:CDS)' AS `Creating CDS nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 48 (offset: 48))\\n\"// RETURN \\'(:CDS)\\' AS `Creating CDS nodes...`;\"\\n                                               ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.21603894233703613\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 48 (offset: 48))\\n\"// RETURN \\'(:CDS)\\' AS `Creating CDS nodes...`;\"\\n                                               ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_cds.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=8kzH%2FRzYLQ%2BZc4VNwaegvDRTbpE%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as cds_row\n",
      "MERGE (cds:CDS { gfe_name: cds_row.gfe_name })\n",
      "ON CREATE SET cds.bp_seq_id = cds_row.bp_seq_id,\n",
      "    cds.bp_sequence = cds_row.bp_sequence,\n",
      "    cds.bp_length = size(cds_row.bp_sequence),\n",
      "    cds.aa_seq_id = cds_row.aa_seq_id,\n",
      "    cds.aa_sequence = cds_row.aa_sequence,\n",
      "    cds.aa_length = size(cds_row.aa_sequence);\n",
      "Time elapsed: 0.3990211486816406\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:IMGT_HLA)' AS `Creating IMGT_HLA nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 58 (offset: 58))\\n\"// RETURN \\'(:IMGT_HLA)\\' AS `Creating IMGT_HLA nodes...`;\"\\n                                                         ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.21792197227478027\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 58 (offset: 58))\\n\"// RETURN \\'(:IMGT_HLA)\\' AS `Creating IMGT_HLA nodes...`;\"\\n                                                         ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000\n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\n",
      "MERGE (imgt:IMGT_HLA { name: row.hla_name })\n",
      "ON CREATE SET imgt.releases = [replace(row.imgt_release, '.', '')]\n",
      "ON MATCH SET imgt.releases = imgt.releases + [replace(row.imgt_release, '.', '')];\n",
      "Time elapsed: 0.38378071784973145\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "RETURN '(:G)' AS `Creating G nodes...`;\n",
      "Time elapsed: 0.21654605865478516\n",
      "Response: {'results': [{'columns': ['Creating G nodes...'], 'data': [{'row': ['(:G)'], 'meta': [None]}]}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\n",
      "FOREACH(_ IN CASE \n",
      "    WHEN groups_row.ard_name = 'G' THEN [1] \n",
      "    ELSE [] END | \n",
      "        MERGE (_g:G { ard_id: groups_row.ard_id })\n",
      "        ON CREATE SET _g.label = 'G'\n",
      ");\n",
      "Time elapsed: 0.3148481845855713\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:lg)' AS `Creating lg nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 46 (offset: 46))\\n\"// RETURN \\'(:lg)\\' AS `Creating lg nodes...`;\"\\n                                             ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.21388697624206543\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 46 (offset: 46))\\n\"// RETURN \\'(:lg)\\' AS `Creating lg nodes...`;\"\\n                                             ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\n",
      "FOREACH(_ IN CASE \n",
      "    WHEN groups_row.ard_name = 'lg' THEN [1] \n",
      "    ELSE [] END |\n",
      "        MERGE (_lg:lg { ard_id: groups_row.ard_id })\n",
      "        ON CREATE SET _lg.label = 'lg'\n",
      ");\n",
      "Time elapsed: 0.34870290756225586\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:lgx)' AS `Creating lgx nodes...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 48 (offset: 48))\\n\"// RETURN \\'(:lgx)\\' AS `Creating lgx nodes...`;\"\\n                                               ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.20666980743408203\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 48 (offset: 48))\\n\"// RETURN \\'(:lgx)\\' AS `Creating lgx nodes...`;\"\\n                                               ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\n",
      "FOREACH(_ IN CASE \n",
      "    WHEN groups_row.ard_name = 'lgx' THEN [1] \n",
      "    ELSE [] END |\n",
      "        MERGE (_lgx:lgx { ard_id: groups_row.ard_id })\n",
      "        ON CREATE SET _lgx.label = 'lgx'\n",
      ");\n",
      "Time elapsed: 0.3314628601074219\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:IMGT_HLA)-[:HAS_GFE]->(:GFE)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 76 (offset: 76))\\n\"// RETURN \\'(:IMGT_HLA)-[:HAS_GFE]->(:GFE)\\' AS `Creating relationships...`;\"\\n                                                                           ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.544482946395874\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 76 (offset: 76))\\n\"// RETURN \\'(:IMGT_HLA)-[:HAS_GFE]->(:GFE)\\' AS `Creating relationships...`;\"\\n                                                                           ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000\n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\n",
      "MATCH (gfe:GFE { gfe_name: row.gfe_name })\n",
      "MATCH (imgt:IMGT_HLA { name: row.hla_name })\n",
      "MERGE (imgt)-[rel:HAS_GFE]->(gfe)\n",
      "ON CREATE SET rel.releases = [replace(row.imgt_release, '.', '')]\n",
      "ON MATCH SET rel.releases = rel.releases + [replace(row.imgt_release, '.', '')];\n",
      "Time elapsed: 0.5668051242828369\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:GFE)-[:HAS_SEQUENCE]->(:Sequence)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 81 (offset: 81))\\n\"// RETURN \\'(:GFE)-[:HAS_SEQUENCE]->(:Sequence)\\' AS `Creating relationships...`;\"\\n                                                                                ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.4510488510131836\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 81 (offset: 81))\\n\"// RETURN \\'(:GFE)-[:HAS_SEQUENCE]->(:Sequence)\\' AS `Creating relationships...`;\"\\n                                                                                ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000\n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/gfe_sequences.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=2AIeI2u%2F2F0OPqQ5D%2F0NfwGCsaI%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\n",
      "MATCH (gfe:GFE { gfe_name: row.gfe_name })\n",
      "MATCH (seq:Sequence { sequence: row.sequence })\n",
      "MERGE (gfe)-[:HAS_SEQUENCE]->(seq);\n",
      "Time elapsed: 0.5317821502685547\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// apoc.periodic.iterate()\n",
      "// RETURN '(:GFE)-[:HAS_FEATURE]->(:Feature)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 79 (offset: 106))\\n\"// RETURN \\'(:GFE)-[:HAS_FEATURE]->(:Feature)\\' AS `Creating relationships...`;\"\\n                                                                              ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.3582756519317627\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 79 (offset: 106))\\n\"// RETURN \\'(:GFE)-[:HAS_FEATURE]->(:Feature)\\' AS `Creating relationships...`;\"\\n                                                                              ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000\n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_features.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=1J0HI5JeWa6bc3g%2Foqx1vV6PXq4%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as row\n",
      "MATCH (gfe:GFE { gfe_name: row.gfe_name })\n",
      "MATCH (f:Feature { \n",
      "    locus: row.locus,\n",
      "    rank: row.rank,\n",
      "    term: row.term,\n",
      "    accession: row.accession\n",
      "    })\n",
      "MERGE (gfe)-[:HAS_FEATURE]->(f);\n",
      "Time elapsed: 1.0265920162200928\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:GFE)-[:HAS_ALIGNMENT]->(:GenomicAlignment)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 90 (offset: 90))\\n\"// RETURN \\'(:GFE)-[:HAS_ALIGNMENT]->(:GenomicAlignment)\\' AS `Creating relationships...`;\"\\n                                                                                         ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.4299130439758301\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 90 (offset: 90))\\n\"// RETURN \\'(:GFE)-[:HAS_ALIGNMENT]->(:GenomicAlignment)\\' AS `Creating relationships...`;\"\\n                                                                                         ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\n",
      "MATCH (gfe:GFE { gfe_name: align_row.gfe_name })\n",
      "MATCH (gen:GenomicAlignment { bp_sequence: align_row.bp_sequence })\n",
      "MERGE (gfe)-[:HAS_ALIGNMENT]->(gen);\n",
      "Time elapsed: 0.41069507598876953\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:GFE)-[:HAS_ALIGNMENT]->(:NucleotideAlignment)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 93 (offset: 93))\\n\"// RETURN \\'(:GFE)-[:HAS_ALIGNMENT]->(:NucleotideAlignment)\\' AS `Creating relationships...`;\"\\n                                                                                            ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.20842409133911133\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 93 (offset: 93))\\n\"// RETURN \\'(:GFE)-[:HAS_ALIGNMENT]->(:NucleotideAlignment)\\' AS `Creating relationships...`;\"\\n                                                                                            ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\n",
      "MATCH (gfe:GFE { gfe_name: align_row.gfe_name })\n",
      "MATCH (nuc:NucleotideAlignment { bp_sequence: align_row.bp_sequence })\n",
      "MERGE (gfe)-[:HAS_ALIGNMENT]->(nuc);\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 90 (offset: 90))\\n\"// RETURN \\'(:GFE)-[:HAS_ALIGNMENT]->(:ProteinAlignment)\\' AS `Creating relationships...`;\"\\n                                                                                         ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.3331451416015625\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:GFE)-[:HAS_ALIGNMENT]->(:ProteinAlignment)' AS `Creating relationships...`;\n",
      "Time elapsed: 0.2050490379333496\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 90 (offset: 90))\\n\"// RETURN \\'(:GFE)-[:HAS_ALIGNMENT]->(:ProteinAlignment)\\' AS `Creating relationships...`;\"\\n                                                                                         ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_alignments.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=VqOKX8kx4rnEEmvNKoHeJElODEs%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as align_row\n",
      "MATCH (gfe:GFE { gfe_name: align_row.gfe_name })\n",
      "MATCH (prot:ProteinAlignment { aa_sequence: align_row.aa_sequence })\n",
      "MERGE (gfe)-[:HAS_ALIGNMENT]->(prot);\n",
      "Time elapsed: 0.30015087127685547\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// apoc.periodic.iterate()\n",
      "// RETURN '(:IMGT_HLA)-[:G]->(:G)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 68 (offset: 95))\\n\"// RETURN \\'(:IMGT_HLA)-[:G]->(:G)\\' AS `Creating relationships...`;\"\\n                                                                   ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.22046613693237305\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 68 (offset: 95))\\n\"// RETURN \\'(:IMGT_HLA)-[:G]->(:G)\\' AS `Creating relationships...`;\"\\n                                                                   ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\n",
      "MATCH (hla:IMGT_HLA { name: groups_row.hla_name })\n",
      "MATCH (_g:G { ard_id: groups_row.ard_id }) \n",
      "MERGE (hla)-[:G]->(_g);\n",
      "Time elapsed: 0.2803819179534912\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// apoc.periodic.iterate()\n",
      "// RETURN '(:IMGT_HLA)-[:lg]->(:lg)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 70 (offset: 97))\\n\"// RETURN \\'(:IMGT_HLA)-[:lg]->(:lg)\\' AS `Creating relationships...`;\"\\n                                                                     ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.21182513236999512\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 70 (offset: 97))\\n\"// RETURN \\'(:IMGT_HLA)-[:lg]->(:lg)\\' AS `Creating relationships...`;\"\\n                                                                     ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\n",
      "MATCH (hla:IMGT_HLA { name: groups_row.hla_name })\n",
      "MATCH (_lg:lg { ard_id: groups_row.ard_id }) \n",
      "MERGE (hla)-[:lg]->(_lg);\n",
      "Time elapsed: 0.286099910736084\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// apoc.periodic.iterate()\n",
      "// RETURN '(:IMGT_HLA)-[:lgx]->(:lgx)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 72 (offset: 99))\\n\"// RETURN \\'(:IMGT_HLA)-[:lgx]->(:lgx)\\' AS `Creating relationships...`;\"\\n                                                                       ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.26346898078918457\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 3, column 72 (offset: 99))\\n\"// RETURN \\'(:IMGT_HLA)-[:lgx]->(:lgx)\\' AS `Creating relationships...`;\"\\n                                                                       ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_groups.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=wpuEj2oYE4yrNgPfo7Q5PWo0ebg%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as groups_row\n",
      "MATCH (hla:IMGT_HLA { name: groups_row.hla_name })\n",
      "MATCH (_lgx:lgx { ard_id: groups_row.ard_id })\n",
      "MERGE (hla)-[:lgx]->(_lgx);\n",
      "Time elapsed: 0.3388981819152832\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "// RETURN '(:Sequence)-[:HAS_CDS]->(:CDS)' AS `Creating relationships...`;\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "{'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 76 (offset: 76))\\n\"// RETURN \\'(:Sequence)-[:HAS_CDS]->(:CDS)\\' AS `Creating relationships...`;\"\\n                                                                           ^'}]}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time elapsed: 0.20804595947265625\n",
      "Response: {'results': [], 'errors': [{'code': 'Neo.ClientError.Statement.SyntaxError', 'message': 'Unexpected end of input: expected whitespace, comment, CYPHER options, EXPLAIN, PROFILE or Query (line 2, column 76 (offset: 76))\\n\"// RETURN \\'(:Sequence)-[:HAS_CDS]->(:CDS)\\' AS `Creating relationships...`;\"\\n                                                                           ^'}]}\n",
      "\n",
      "\n",
      "Executing statement: \n",
      "USING PERIODIC COMMIT 50000 \n",
      "LOAD CSV WITH HEADERS FROM 'https://gfe-db-4498.s3.amazonaws.com/data/3420/csv/all_cds.3420.csv?AWSAccessKeyId=ASIAXXVOWRIZNSUDKIY2&Signature=8kzH%2FRzYLQ%2BZc4VNwaegvDRTbpE%3D&x-amz-security-token=IQoJb3JpZ2luX2VjEGAaCXVzLWVhc3QtMSJHMEUCIQCUpldAKgTg8S%2B%2BRTpcIAp6Dn0fODg05Y%2F5vv5g5ac3UgIgMCE4QSCvUkRUGH%2FUFX4M0CfBSoJvBTP2puvS4Yzm7%2FYq9wIIeRACGgw1MzE4Njg1ODQ0OTgiDOcw4MFqNURnhGybkirUAmTLtKOC5b0uTneab8WueAKvkMyHYQWC2kdGCxaCofMbMfezoArDEZEZ6GyPo4nGNv2k70UkwxS3uNWKyi4sPuzNVCOXWVC%2BdOkUualU4rZwLQzb9jS8%2BXopCKVip86haAd2xMf542O3Syr0011lZVzayrncEwr7GevJPFzhlvgdF9Xt41HBGk2A4YrEb%2FsVa%2B0jWLdNS5lWDaYTt1r1UOw9HJJloB%2Fh7ahFWhlaZP91nApYoFUxxB1X97Sw6IiqthQ3BtJocGXA9yhZjJhfk%2FzIabRR8dhbZsmk7sQ%2Bdop1JURhj30Oi8sw%2FGXM99JfBSetxM53K6CjKrvFWheRzpdE1eZbfzTk1j7Atmgx2WF1TMuVnUGisD9Cj3s9FXxZBPt9pXcglV95tDs5B%2BH1Cl%2FRqx6wzA%2FXaJPJ2CLn%2FP7rJ%2FTwTmCNaDoIx9RQLxyMtZTeEf0w29q6iAY6pgHfPNpFHyh3hBF3Ed8Awpzi274rDZAipMoz%2Bwrd2P2sMCsFwawRdGASMkUmyU6aaAoC245T7yBAr6PMPjCRzKXFh1Cura%2FrP8Z7X0DFUN0K5tVxSM%2Fii4ZDIAcqzImWINqkKhObkuaIA%2BF0%2BnokoG1385D6D1FZQGePCQn5WPAwn9TSjlUcY2rxplpi4RMBZDVEYkQdjTfnxDNOz%2FxGE8gkv7%2BwsBpe&Expires=1628360417' as cds_row\n",
      "MATCH (gfe:GFE)-[:HAS_SEQUENCE]->(seq:Sequence)\n",
      "MATCH (cds:CDS { bp_sequence: cds_row.bp_sequence })\n",
      "WHERE cds_row.gfe_name = gfe.gfe_name\n",
      "MERGE (seq)-[:HAS_CDS]->(cds);\n",
      "Time elapsed: 0.956387996673584\n",
      "Response: {'results': [{'columns': [], 'data': []}], 'errors': []}\n",
      "\n",
      "\n",
      "Time elapsed: 15.759983777999878 seconds\n"
     ]
    }
   ],
   "source": [
    "#limit = 1\n",
    "\n",
    "start = time.time()\n",
    "for idx, statement in enumerate(cypher):\n",
    "    print(f'Executing statement: {statement}')\n",
    "    statement_start = time.time()\n",
    "    response = run_cypher(statement, debug=True)\n",
    "    statement_end = time.time()\n",
    "    statement_elapsed_time = statement_end - statement_start\n",
    "    logger.info(f'Statement: {statement}\\nTime elapsed: {statement_elapsed_time}\\nResponse: {response}')\n",
    "    print(f'Time elapsed: {statement_elapsed_time}\\nResponse: {response}\\n\\n')\n",
    "    #if limit and idx + 1 == limit:\n",
    "    #    break\n",
    "        \n",
    "end = time.time()\n",
    "time_elapsed = end - start\n",
    "print(f\"Time elapsed: {time_elapsed} seconds\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a1e548a7",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "gfe-db",
   "language": "python",
   "name": "gfe-db"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
